In [1]:
import pandas as pd

# Dictionary we will work on
myDict = {"fname": ["Siddhant", "Manish", "Kanai", "Ram"],
         "lname": ["Shah", "Jha", "Murmu", "Jana"],
         "age": [32, 32, 30, 33],
         "score": [9.1, 8.7, 8.9, 9.6],
         "email": ["sid@panda.com", "man@panda.com", "kan@panda.com", "ram@panda.com"]}

# creating dataframe
df = pd.DataFrame.from_dict(data=myDict)
df

      fname  lname  age  score          email
0  Siddhant   Shah   32    9.1  sid@panda.com
1    Manish    Jha   32    8.7  man@panda.com
2     Kanai  Murmu   30    8.9  kan@panda.com
3       Ram   Jana   33    9.6  ram@panda.com

In [2]:
# shape: this method returns a tupple of two elements. 
# 1st element is the number of rows and 2nd element is the number of columns dataframe has.
df.shape

(4, 5)

In [3]:
# We will find some of the command of dataframe ends with parenthese and some dosen't. 
# As we know that dataframe is a class in panda, so it has some attributes and some methods. 

# Methods are actionable commands which might need some value passed to them to do some task 
# and so they have parenthese at end. 

# Attributes on the other hand just provide information about the object and it doesnt need 
# any value passed to them. So there is no requirement of parenthese at the end of them.

In [4]:
# size: this attributes provide total numbe of elements (excluding NAN) in the dataframe.
df.size

20

In [5]:
# dtypes: This atribute provides a series where keys are the column names of the dataframe and values are
# the datatypes of the columns. If more then one datatype the it will be treated as a object datatype.
df.dtypes

fname     object
lname     object
age        int64
score    float64
email     object
dtype: object

In [6]:
#  ndim: This attribute provides dimension of the the panda datastructure. For Series it return 1 
# and for Dataframe it returns 2
df.ndim

2

In [7]:
# empty: this attribute return True if dataset is empty else retuns false
df.empty

False

In [8]:
# columns: This attribute retuns list of all column name in a dataframe
df.columns

Index(['fname', 'lname', 'age', 'score', 'email'], dtype='object')

In [9]:
# T: This attribute transponse a current dataframe and returns a new one with columns and rows 
# getting interchanged 
df.T

                   0              1              2              3
fname       Siddhant         Manish          Kanai            Ram
lname           Shah            Jha          Murmu           Jana
age               32             32             30             33
score            9.1            8.7            8.9            9.6
email  sid@panda.com  man@panda.com  kan@panda.com  ram@panda.com

In [10]:
# head(n): This method accepts a number and returns that number of top rows from dataframe. 
# Default number is 5
df.head(4)

      fname  lname  age  score          email
0  Siddhant   Shah   32    9.1  sid@panda.com
1    Manish    Jha   32    8.7  man@panda.com
2     Kanai  Murmu   30    8.9  kan@panda.com
3       Ram   Jana   33    9.6  ram@panda.com

In [11]:
# tail(n): This method accepts a number and returns that number of last rows from dataframe. 
# Default is 5
df.tail()

      fname  lname  age  score          email
0  Siddhant   Shah   32    9.1  sid@panda.com
1    Manish    Jha   32    8.7  man@panda.com
2     Kanai  Murmu   30    8.9  kan@panda.com
3       Ram   Jana   33    9.6  ram@panda.com

In [12]:
# describe(): This method returns a new dataframe depicting statistics of the numerical columns 
# of current dataframe. 
df.describe()

             age     score
count   4.000000  4.000000
mean   31.750000  9.075000
std     1.258306  0.386221
min    30.000000  8.700000
25%    31.500000  8.850000
50%    32.000000  9.000000
75%    32.250000  9.225000
max    33.000000  9.600000

In [13]:
# sum(): This method returns a series with index being the column name and values being the sum of all the 
# value for that particular column. For numerical column, the data is added and for object(string) column, 
# data is concatenated.
df.sum()

fname                               SiddhantManishKanaiRam
lname                                     ShahJhaMurmuJana
age                                                    127
score                                                 36.3
email    sid@panda.comman@panda.comkan@panda.comram@pan...
dtype: object

In [14]:
# mean(): This method returns a series with index being the numerical column name and values being the mean of 
# data numerical column. Colums with datatypes as object(string) are ignored.
df.mean()

age      31.750
score     9.075
dtype: float64

In [15]:
# std(): This method returns a series with index being the numerical column name and values being the 
# Standard Deviation of data numerical column. Colums with datatypes as object(string) are ignored.
df.std()

age      1.258306
score    0.386221
dtype: float64

In [16]:
# count(): This method returns series with index being the column name and values being the number of non-null
# elements in that column
df.count()

fname    4
lname    4
age      4
score    4
email    4
dtype: int64

In [17]:
# Simillar to this we have other statistical method like mode(), min(), max(), median(0 and few more)